davelee98/Firmware_Unified/targets/esp32-idf/src/display_service.cpp
// Bring the panel up for a transfer/refresh. Returns true iff it was COLD (rail
// was off) — callers may need to (re)open the address window regardless.
static bool epdSessionAcquire(bool partialInit) {
    pwrmgmLockTake();
    bool cold;
    if (pwrmgmState == PWR_OFF) {
        od_log_info("[EPD session] acquire: COLD bring-up");
        pwrmgm(true);   // -> PWR_ACTIVE (guarded; real transition)
        if (!epdSessionUsesFastepd()) {
            const DisplayConfig& d = globalConfig.displays[0];
#ifdef BBEP_T133A01
            if (e1004_panel_used()) {
                e1004InitPanel();
                epdSessionInitWasPartial = false;
            } else
#endif
            {
                bbepInitIO(&bbep, d.dc_pin, d.reset_pin, d.busy_pin, d.cs_pin, d.data_pin, d.clk_pin, 8000000);
                bbepWakeUp(&bbep);
                const uint8_t* initSeq = partialInit ? (bbep.pInitPart ? bbep.pInitPart : bbep.pInitFull)
                                                     : bbep.pInitFull;
                bbepSendCMDSequence(&bbep, initSeq);
                epdAlignCustomPartialRamMode();
                epdSessionInitWasPartial = partialInit;
            }
        }
        cold = true;
    } else {
        // WARM re-acquire (or, defensively, an already-ACTIVE re-entry).
        od_log_info(pwrmgmState == PWR_ACTIVE ? "[EPD session] acquire: already ACTIVE (defensive)"
                                              : "[EPD session] acquire: WARM re-acquire");
        pwrmgmState = PWR_ACTIVE;
        pwrmgmOffDeadlineMs = 0;   // cancel keep-alive
        // Phase 1: full re-init on warm re-acquire (HW reset => registers identical
        // to cold, safest). Phase 2a will skip bbepWakeUp + resend only on change.
        if (!epdSessionUsesFastepd()) {
#ifdef BBEP_T133A01
            if (e1004_panel_used()) {
                epdSessionInitWasPartial = false;
            } else
#endif
            {
                bbepWakeUp(&bbep);
                const uint8_t* initSeq = partialInit ? (bbep.pInitPart ? bbep.pInitPart : bbep.pInitFull)
                                                     : bbep.pInitFull;
                bbepSendCMDSequence(&bbep, initSeq);
                epdAlignCustomPartialRamMode();
                epdSessionInitWasPartial = partialInit;
            }
        }
        cold = false;
    }
    pwrmgmLockGive();
    return cold;
}

// Finish a transfer/refresh. On success (and when keep-alive is enabled) the panel
// stays powered + AWAKE and enters PWR_WARM with an armed deadline; otherwise it is
// powered fully down now.
static void epdSessionRelease(bool refreshSuccess) {
    pwrmgmLockTake();
    if (pwrmgmState == PWR_OFF) { pwrmgmLockGive(); return; }   // nothing to release
    uint32_t window = epdKeepAliveWindowMs();
    if (window == 0 || !refreshSuccess) {
        od_log_info(refreshSuccess ? "[EPD session] release: keep-alive disabled, powering off"
                                   : "[EPD session] release: refresh failed, powering off");
        epdSessionForceOffLocked();
    } else {
        pwrmgmState = PWR_WARM;
        pwrmgmOffDeadlineMs = millis() + window;
        // Controller stays AWAKE (no bbepSleep; is_awake stays 1); rail/SPI stay up.
        od_log_info("[EPD session] release: panel warm-idle, off in %u ms", (unsigned)window);
    }
    pwrmgmLockGive();
}

void epdSessionForceOff(void) {
    pwrmgmLockTake();
    epdSessionForceOffLocked();
    pwrmgmLockGive();
}

void epdSessionTick(void) {
    if (pwrmgmState != PWR_WARM) return;   // fast pre-check (only WARM arms the timer)
    if (!pwrmgmLockTryTake()) return;      // held by a transfer -> skip this pass
    // Re-check under the lock: a transfer may have moved us out of WARM meanwhile.
    if (pwrmgmState == PWR_WARM && (int32_t)(millis() - pwrmgmOffDeadlineMs) >= 0) {
        od_log_info("[EPD session] keep-alive expired — powering panel off");
        epdSessionForceOffLocked();
    }
    pwrmgmLockGive();
}

bool epdSessionIsWarm(void) {
    return pwrmgmState == PWR_WARM;
}

static bool refreshBootScreenFull() {
    if (!writeBootScreenWithQr()) {
        od_log_warn("Boot screen render failed");
        return false;
    }
    od_log_info("EPD refresh: FULL (boot)");
    touchSuspendForEpdRefresh();
    bbepRefresh(&bbep, REFRESH_FULL);
    return waitforrefresh(60);
}

static void cleanup_partial_write_state(void);
static bool panel_skips_bbep_set_addr_window(void);
static void partial_set_addr_window(BBEPDISP *pBBEP, int x, int y, int cx, int cy);
static bool partial_consume_bytes(uint8_t* data, uint32_t len);
static void partial_prepare_panel_ram(void);
static bool partial_write_to_panel(int refreshMode);
static bool partial_write_stream_bytes(uint8_t* data, uint32_t len);
static bool zlib_stream_to_direct_write(const uint8_t* data, uint32_t len, bool final);
static bool zlib_stream_to_partial_write(const uint8_t* data, uint32_t len, bool final);
static uint32_t calc_controller_plane_bytes(uint16_t width, uint16_t height);
static uint32_t parse_be_u32(const uint8_t* data);
static void send_direct_write_nack(uint8_t opcode, uint8_t error, bool cleanupState);
static PartialStreamContext partialCtx = {};

// Direct-write session-setup helpers (shared by legacy 0x70 START and PIPE 0x80 START)
// and the shared END/refresh tail (shared by legacy 0x72 END, PIPE 0x82 END, and
// both auto-complete paths). Declared here; defined below near the direct-write handlers.
static void directWriteComputeGeometry(bool compressed);
static void directWriteActivatePanel(void);
static void directWriteFinishAndRefresh(uint8_t* data, uint16_t len, uint8_t endOpcode);

#ifdef TARGET_ESP32
// Defined in main.cpp. The response ring's only drainer is the loop task, which is
// the same task running these handlers — so anything queued here stays queued until
// we return. Call it before any multi-second blocking work (see the refresh tail).
extern void flushResponseQueueToBle();
#endif

// PIPE_WRITE (0x0080-0x0082) sliding-window receive state + reorder queue. Declared
// early so the quiet-logging predicates below can consult pipeState.active. The
// reorder array is a file static (not in the struct) so both targets pay it once.
static PipeWriteState pipeState = {};
static PipeReorderSlot pipeReorder[PIPE_REORDER_SLOTS];

void checkPartialWriteTimeout(void) {
    if (partialCtx.active && partialCtx.start_time > 0 &&
        (millis() - partialCtx.start_time) > 900000UL) {
        od_log_error("ERROR: Partial write timeout - cleaning up stuck state");
        cleanup_partial_write_state();
        // A pipe-partial transfer shares partialCtx: also clear pipeState so a zombie
        // pipeState.active can't misroute later 0x0081 frames into the dead partialCtx.
        if (pipeState.partial) resetPipeWriteState();
    }
}

// Disconnect hook: a partial session (0x76 or pipe-partial) powers the panel via
// partial_prepare_panel_ram but never sets directWriteActive, so the disconnect
// handlers' cleanupDirectWriteState gate misses it and the panel would stay
// powered until the 15-min watchdog. cleanup_partial_write_state is file-static;
// this wrapper gives the BLE callbacks a safe no-op-when-idle entry point.
void cleanupPartialWriteOnDisconnect(void) {
    if (partialCtx.active) cleanup_partial_write_state();
}

#define AXP2101_SLAVE_ADDRESS 0x34
#define AXP2101_REG_POWER_STATUS 0x00
#define AXP2101_REG_DC_ONOFF_DVM_CTRL 0x80
#define AXP2101_REG_LDO_ONOFF_CTRL0 0x90
#define AXP2101_REG_DC_VOL0_CTRL 0x82
#define AXP2101_REG_LDO_VOL2_CTRL 0x94
#define AXP2101_REG_LDO_VOL3_CTRL 0x95
#define AXP2101_REG_POWER_WAKEUP_CTL 0x26
#define AXP2101_REG_ADC_CHANNEL_CTRL 0x30
#define AXP2101_REG_ADC_DATA_BAT_VOL_H 0x34
#define AXP2101_REG_ADC_DATA_VBUS_VOL_H 0x36
#define AXP2101_REG_ADC_DATA_SYS_VOL_H 0x38
#define AXP2101_REG_BAT_PERCENT_DATA 0xA4
#define AXP2101_REG_PWRON_STATUS 0x20
#define AXP2101_REG_IRQ_ENABLE1 0x40
#define AXP2101_REG_IRQ_ENABLE2 0x41
#define AXP2101_REG_IRQ_ENABLE3 0x42
#define AXP2101_REG_IRQ_ENABLE4 0x43
#define AXP2101_REG_IRQ_STATUS1 0x44
#define AXP2101_REG_IRQ_STATUS2 0x45
#define AXP2101_REG_IRQ_STATUS3 0x46
#define AXP2101_REG_IRQ_STATUS4 0x47
#define AXP2101_REG_LDO_ONOFF_CTRL1 0x91
#define FONT_BASE_WIDTH 8
#define FONT_BASE_HEIGHT 8
#define FONT_SMALL_THRESHOLD 264

