davelee98/Firmware_Unified/targets/esp32-idf/src/display_service.cpp
extern const uint8_t writelineFont[] PROGMEM;
extern uint8_t staticRowBuffer[BOOT_ROW_BUFFER_SIZE];

int bbepSetPanelType(BBEPDISP *pBBEP, int iPanel);
void bbepSetRotation(BBEPDISP *pBBEP, int iRotation);

int mapEpd(int id){
    switch(id) {
        case 0x0000: return EP_PANEL_UNDEFINED;
        case 0x0001: return EP42_400x300;
        case 0x0002: return EP42B_400x300;
        case 0x0003: return EP213_122x250;
        case 0x0004: return EP213B_122x250;
        case 0x0005: return EP293_128x296;
        case 0x0006: return EP294_128x296;
        case 0x0007: return EP295_128x296;
        case 0x0008: return EP295_128x296_4GRAY;
        case 0x0009: return EP266_152x296;
        case 0x000A: return EP102_80x128;
        case 0x000B: return EP27B_176x264;
        case 0x000C: return EP29R_128x296;
        case 0x000D: return EP122_192x176;
        case 0x000E: return EP154R_152x152;
        case 0x000F: return EP42R_400x300;
        case 0x0010: return EP42R2_400x300;
        case 0x0011: return EP37_240x416;
        case 0x0012: return EP37B_240x416;
        case 0x0013: return EP213_104x212;
        case 0x0014: return EP75_800x480;
        case 0x0015: return EP75_800x480_4GRAY;
        case 0x0016: return EP75_800x480_4GRAY_V2;
        case 0x0017: return EP29_128x296;
        case 0x0018: return EP29_128x296_4GRAY;
        case 0x0019: return EP213R_122x250;
        case 0x001A: return EP154_200x200;
        case 0x001B: return EP154B_200x200;
        case 0x001C: return EP266YR_184x360;
        case 0x001D: return EP29YR_128x296;
        case 0x001E: return EP29YR_168x384;
        case 0x001F: return EP583_648x480;
        case 0x0020: return EP296_128x296;
        case 0x0021: return EP26R_152x296;
        case 0x0022: return EP73_800x480;
        case 0x0023: return EP73_SPECTRA_800x480;
        case 0x0024: return EP74R_640x384;
        case 0x0025: return EP583R_600x448;
        case 0x0026: return EP75R_800x480;
        case 0x0027: return EP426_800x480;
        case 0x0028: return EP426_800x480_4GRAY;
        case 0x0029: return EP29R2_128x296;
        case 0x002A: return EP41_640x400;
        case 0x002B: return EP81_SPECTRA_1024x576;
        case 0x002C: return EP7_960x640;
        case 0x002D: return EP213R2_122x250;
        case 0x002E: return EP29Z_128x296;
        case 0x002F: return EP29Z_128x296_4GRAY;
        case 0x0030: return EP213Z_122x250;
        case 0x0031: return EP213Z_122x250_4GRAY;
        case 0x0032: return EP154Z_152x152;
        case 0x0033: return EP579_792x272;
        case 0x0034: return EP213YR_122x250;
        case 0x0035: return EP37YR_240x416;
        case 0x0036: return EP35YR_184x384;
        case 0x0037: return EP397YR_800x480;
        case 0x0038: return EP154YR_200x200;
        case 0x0039: return EP266YR2_184x360;
        case 0x003A: return EP42YR_400x300;
        case 0x003B: return EP75_800x480_GEN2;
        case 0x003C: return EP75_800x480_4GRAY_GEN2;
        case 0x003D: return EP215YR_160x296;
        case 0x003E: return EP1085_1360x480;
        case 0x003F: return EP31_240x320;
        case 0x0040: return EP75YR_800x480;
        case 0x0041: return EP_PANEL_UNDEFINED;
#ifdef BBEP_T133A01
        case OD_PANEL_IC_EP133A_SPECTRA_1200X1600: return EP133A_SPECTRA_1200x1600; // 0x0042, Seeed reTerminal E1004
#else
        case 0x0042: return EP_PANEL_UNDEFINED;
#endif
        case 0x0043: return EP154_200x200_4GRAY;
        case 0x0044: return EP42B_400x300_4GRAY;
        case 0x0045: return EP397_800x480;
        case 0x0046: return EP397_800x480_4GRAY;
        case 0x0047: return EP368_792x528;
        case 0x0048: return EP368_792x528_4GRAY;
        case 0x0049: return EP213ZZ_122x250;
        case 0x004A: return EP40_SPECTRA_400x600;
        case 0x004B: return EP27_176x264;
        case 0x004C: return EP27_176x264_4GRAY;
        default: return EP_PANEL_UNDEFINED;
    }
}

bool fastepd_driver_used(void) {
#if !defined(TARGET_ESP32) || !defined(OPENDISPLAY_FASTEPD)
    return false;
#else
    if (globalConfig.display_count < 1) return false;
    const struct DisplayConfig& d = globalConfig.displays[0];
    if (d.panel_ic_type != OD_PANEL_IC_ED103TC2_1872X1404 &&
        d.panel_ic_type != OD_PANEL_IC_ED103TC2_1872X1404_4GRAY) return false;
    if (d.display_technology != 0 && d.display_technology != 1) return false;
    return true;
#endif
}

bool e1004_panel_used(void) {
#ifdef BBEP_T133A01
    if (globalConfig.display_count < 1) return false;
    return globalConfig.displays[0].panel_ic_type == OD_PANEL_IC_EP133A_SPECTRA_1200X1600;
#else
    return false;
#endif
}

// cs_pin_2; 0 or 0xFF defaults to GPIO2.
uint8_t e1004_cs2_pin(void) {
    uint8_t p = globalConfig.displays[0].cs_pin_2;
    if (p == 0 || p == 0xFF) return 2;
    return p;
}

bool waitforrefresh(int timeout){
#if defined(TARGET_ESP32) && defined(OPENDISPLAY_FASTEPD)
    if (fastepd_driver_used()) return fastepd_wait_refresh(timeout);
#endif
    if (e1004_panel_used() && !bbepIsBusy(&bbep)) {
        // bbepRefresh already waited; idle here means refresh finished.
        od_log_info("Refresh completed inside bb_epaper");
        return true;
    }
    // Poll at 10 ms (was 100 ms) so a ~0.5 s refresh returns up to ~90 ms sooner.
    // BUSY asserts within µs of MASTER_ACTIVATE, so the i==0 "never went busy"
    // error check stays valid at a 10 ms first poll. Loop bound scales x10
    // (timeout*100 iterations of 10 ms); dot cadence every 50 iters keeps ~0.5 s/dot.
    for (size_t i = 0; i < (size_t)(timeout * 100); i++){
        delay(10);
        if(i % 50 == 0) od_log_raw(".");
        if(!bbepIsBusy(&bbep)){
            if(i == 0){
                od_log_error("ERROR: Epaper not busy after refresh command - refresh may not have started");
                return false;
            }
            od_log_raw(".\n");
            od_log_info("Refresh took %.2f seconds", (float)i / 100);
//            delay(200);   // EXTRA DELAY HERE IS UNNEEDED AND JUST SLOWS THINGS DOWN
            return true;
        }
    }
    od_log_warn("Refresh timed out");
    return false;
}

#ifdef TARGET_ESP32
static bool s_wire_open_display_ready = false;
static int8_t s_wire_sda_pin = -1;
static int8_t s_wire_scl_pin = -1;
static uint32_t s_wire_clock_hz = 0;

static bool wireBeginForOpenDisplay(int sda, int scl, uint32_t hz) {
    // Do not pinMode() before begin on ESP32 — periman must hand pins to the I2C driver.
    if (Wire.begin(sda, scl, hz)) {
        Wire.setClock(hz);
        s_wire_sda_pin = (int8_t)sda;
        s_wire_scl_pin = (int8_t)scl;
        s_wire_clock_hz = hz;
        s_wire_open_display_ready = true;
        return true;
    }
    if (hz > 100000u && Wire.begin(sda, scl, 100000u)) {
        od_log_info("NOTE: I2C fallback to 100kHz (SDA=GPIO%d SCL=GPIO%d)", sda, scl);
        Wire.setClock(100000u);
        s_wire_sda_pin = (int8_t)sda;
        s_wire_scl_pin = (int8_t)scl;
        s_wire_clock_hz = 100000u;
        s_wire_open_display_ready = true;
        return true;
    }
    od_log_error("ERROR: Wire.begin failed (SDA=GPIO%d SCL=GPIO%d)", sda, scl);
    return false;
}
#endif

static bool i2cDataBusValid(uint8_t bus_id) {
    if (bus_id >= globalConfig.data_bus_count) {
        return false;
    }
    const struct DataBus& bus = globalConfig.data_buses[bus_id];
    return bus.bus_type == 0x01 && bus.pin_1 != 0xFF && bus.pin_2 != 0xFF;
}

