davelee98/Firmware_Unified/targets/esp32-idf/src/display_service.cpp
void updatemsdata(){
    // od_log_debug("updatemsdata() called (mloopcounter: %u)", mloopcounter);
    pollSht40SensorsForMsd();
    pollBq27220ForMsd();
    float batteryVoltage = readBatteryVoltage();
    float chipTemperature = readChipTemperature();
    uint16_t batteryVoltage10mv = 0;
    if (batteryVoltage >= 0.0f) {
        uint16_t batteryVoltageMv = (uint16_t)(batteryVoltage * 1000.0f);
        batteryVoltage10mv = batteryVoltageMv / 10;
        if (batteryVoltage10mv > 511) {
            batteryVoltage10mv = 511;
        }
    }
    int16_t tempEncoded = (int16_t)((chipTemperature + 40.0f) * 2.0f);
    if (tempEncoded < 0) tempEncoded = 0;
    else if (tempEncoded > 255) tempEncoded = 255;
    uint8_t temperatureByte = (uint8_t)tempEncoded;
    uint8_t batteryVoltageLowByte = (uint8_t)(batteryVoltage10mv & 0xFF);
    uint8_t statusByte = (((batteryVoltage10mv >> 8) & 0x01) ? OD_MSD_STATUS_BATTERY_VOLTAGE_BIT8 : 0) |
                         (rebootFlag ? OD_MSD_STATUS_REBOOT_FLAG : 0) |
                         (connectionRequested ? OD_MSD_STATUS_CONNECTION_REQUESTED : 0) |
                         (((uint8_t)(mloopcounter << OD_MSD_STATUS_MAIN_LOOP_COUNTER_SHIFT)) & OD_MSD_STATUS_MAIN_LOOP_COUNTER_MASK);
    // Build the 16-byte advertisement via the canonical wire struct (all little-endian),
    // then copy into the global msd_payload[16] that the BLE adv APIs below consume.
    struct MsdAdvertisement m;
    memset(&m, 0, sizeof m);
    m.company_id = 0x2446;
    memcpy(m.dynamic, dynamicreturndata, sizeof m.dynamic);
    m.chip_temperature = temperatureByte;
    m.battery_voltage_low = batteryVoltageLowByte;
    m.status = statusByte;
    memcpy(msd_payload, &m, sizeof m);
#ifdef TARGET_NRF
    static uint8_t prev_msd_payload_nrf[16] = {0xFF};
    if (memcmp(prev_msd_payload_nrf, msd_payload, 16) == 0) {
        mloopcounter++;
        mloopcounter &= 0x0F;
        return;
    }
    memcpy(prev_msd_payload_nrf, msd_payload, 16);
    Bluefruit.Advertising.clearData();
    Bluefruit.Advertising.addFlags(BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE);
    Bluefruit.Advertising.addName();
    Bluefruit.Advertising.addData(BLE_GAP_AD_TYPE_MANUFACTURER_SPECIFIC_DATA, msd_payload, 16);
    ble_nrf_apply_adv_interval();
    Bluefruit.Advertising.setFastTimeout(1);
    Bluefruit.Advertising.stop();
    Bluefruit.Advertising.start(0);
#endif
#ifdef TARGET_ESP32
    if (advertisementData != nullptr) {
        static uint8_t prev_msd_payload[16] = {0xFF};
        if (memcmp(prev_msd_payload, msd_payload, 16) == 0) {
            mloopcounter++;
            mloopcounter &= 0x0F;
            return;
        }
        memcpy(prev_msd_payload, msd_payload, 16);
        advertisementData->setManufacturerData(msd_payload, 16);
        BLEAdvertising *pAdvertising = (pServer != nullptr) ? pServer->getAdvertising() : BLEDevice::getAdvertising();
        // Only rebuild+restart advertising while disconnected. The former connected
        // branch rebuilt *advertisementData but never pushed it via
        // setAdvertisementData(), so it was dead work — dropped.
        if (pAdvertising != nullptr && !(pServer != nullptr && pServer->getConnectedCount() > 0)) {
            pAdvertising->stop();
            BLEAdvertisementData freshAdvertisementData;
            static String savedDeviceName = "";
            if (savedDeviceName.length() == 0) savedDeviceName = "OD" + getChipIdHex();
            freshAdvertisementData.setName(savedDeviceName.c_str());
            freshAdvertisementData.setFlags(0x06);
            freshAdvertisementData.setManufacturerData(msd_payload, 16);
            *advertisementData = freshAdvertisementData;
            // setAdvertisementData() must be the last data call before start():
            // enableScanResponse()/setPreferredParams() reset NimBLE's custom-data
            // flag and would make start() drop this manufacturer-data payload.
            pAdvertising->setAdvertisementData(freshAdvertisementData);
            delay(50);
            pAdvertising->start();
        }
    }
#ifdef OPENDISPLAY_HAS_WIFI
    opendisplay_mdns_update_msd_txt();
#endif
#endif
    mloopcounter++;
    mloopcounter &= 0x0F;
}

// --- Quiet image-write logging ---------------------------------------------
// An image push arrives as a 0x70 start, many 0x71 data frames, and a 0x72 end.
// Logging every frame + its ack floods the UART (~1 MB of text for a 1.3 MB
// image) and, once the TX buffer fills, throttles the transfer itself. Instead
// we log the first frame in full, a 5%-step percentage meter thereafter, and
// the final frame + chunk total at completion. imageWriteLogQuiet{Cmd,Ack}()
// let communication.cpp suppress the per-frame command/ack spam accordingly.
static uint32_t imgLogTotalBytes;    // expected payload for this stream
static uint32_t imgLogChunks;        // 0x71 frames seen this stream
static uint8_t  imgLogLastStep;      // last 5% step printed (pct/5)
static uint16_t imgLogLastLen;       // length of most recent frame
static uint8_t  imgLogLastHead[16];  // first bytes of most recent frame
static uint8_t  imgLogLastHeadLen;   // valid bytes in imgLogLastHead
static uint32_t imgLogStartMs;       // millis() at stream start (for throughput)

// Builds a space-separated "%02X" hex dump of up to sizeof(imgLogLastHead) bytes into buf.
static void imgLogHex(char* buf, size_t bufSize, const uint8_t* data, uint8_t n) {
    int pos = 0;
    buf[0] = '\0';
    for (uint8_t i = 0; i < n && pos < (int)bufSize; i++) {
        int written = snprintf(buf + pos, bufSize - pos, i > 0 ? " %02X" : "%02X", data[i]);
        if (written < 0) {
            break;
        }
        pos += written;
    }
}

static void imageWriteLogReset(void) {
    imgLogTotalBytes = 0;
    imgLogChunks = 0;
    imgLogLastStep = 0;
    imgLogLastLen = 0;
    imgLogLastHeadLen = 0;
    imgLogStartMs = 0;
}

static void imageWriteLogStart(uint32_t totalBytes) {
    imgLogTotalBytes = totalBytes;
    imgLogStartMs = millis();
    // Whether the sender compressed is decided per transfer (START header flag), not
    // by config, so the transmission_modes dump at boot does not answer it. State the
    // active mode here: without it a slow push is ambiguous between "sent raw" and
    // "compressed but the link is the bottleneck".
    od_log_debug("DW start: %u bytes expected, %s", (unsigned)totalBytes,
                 directWriteCompressed ? "zlib streaming" : "raw (uncompressed)");
}

static void imageWriteLogChunk(const uint8_t* data, uint16_t len) {
    imgLogChunks++;
    imgLogLastLen = len;
    imgLogLastHeadLen = (len < sizeof(imgLogLastHead)) ? (uint8_t)len : (uint8_t)sizeof(imgLogLastHead);
    memcpy(imgLogLastHead, data, imgLogLastHeadLen);
    if (imgLogChunks == 1) {
        char hex[64];
        imgLogHex(hex, sizeof(hex), imgLogLastHead, imgLogLastHeadLen);
        od_log_debug("DW frame 1: %u bytes: %s", len, hex);
        if (len > 0 && imgLogTotalBytes > 0) {
            uint32_t est = (imgLogTotalBytes + len - 1) / len;
            od_log_debug("DW expecting ~%u chunks", (unsigned)est);
        }
    }
}

static void imageWriteLogProgress(uint32_t written, uint32_t total) {
    if (total == 0) return;
    uint32_t pct = (uint64_t)written * 100u / total;
    if (pct >= 100) return;                 // completion summary covers 100%
    uint8_t step = (uint8_t)(pct / 5u);
    if (step <= imgLogLastStep) return;
    imgLogLastStep = step;
    od_log_debug("DW %u%% (%u chunks, %u/%u bytes)", (unsigned)pct, (unsigned)imgLogChunks, (unsigned)written, (unsigned)total);
}

static void imageWriteLogFinish(uint32_t written, uint32_t total) {
    char hex[64];
    imgLogHex(hex, sizeof(hex), imgLogLastHead, imgLogLastHeadLen);
    od_log_debug("DW final frame %u: %u bytes: %s", (unsigned)imgLogChunks, imgLogLastLen, hex);
    uint32_t elapsedMs = millis() - imgLogStartMs;   // unsigned wrap-safe over one stream
    char mode[48] = " raw";
    if (directWriteCompressed) {
        // On-wire bytes vs bytes handed to the panel: the ratio is the only direct
        // evidence the stream actually inflated, and it makes a mis-sized or
        // already-compressed payload obvious.
        if (directWriteCompressedReceived > 0 && written > 0) {
            snprintf(mode, sizeof(mode), " zlib %u B on wire (%.2fx)",
                     (unsigned)directWriteCompressedReceived,
                     (float)written / (float)directWriteCompressedReceived);
        } else {
            snprintf(mode, sizeof(mode), " zlib %u B on wire", (unsigned)directWriteCompressedReceived);
        }
    }
    if (elapsedMs > 0) {
        float rate = (float)written / 1.024f / (float)elapsedMs;  // bytes/ms /1.024 = KB/s
        od_log_info("DW complete: %u chunks, %u/%u bytes,%s, %.2f s, %.1f KB/s",
                    (unsigned)imgLogChunks, (unsigned)written, (unsigned)total, mode, elapsedMs / 1000.0f, rate);
    } else {
        od_log_info("DW complete: %u chunks, %u/%u bytes,%s, %.2f s, n/a KB/s",
                    (unsigned)imgLogChunks, (unsigned)written, (unsigned)total, mode, elapsedMs / 1000.0f);
    }
}

bool imageWriteLogQuietCmd(void) {
    return transferActive() && imgLogChunks >= 1;
}

bool imageWriteLogQuietAck(void) {
    return transferActive() && imgLogChunks >= 2;
}

// True when this raw frame is a mid-stream image-write data chunk (command
// header 0x0071, unencrypted) whose per-frame BLE-receive/queue logging should
// be suppressed. Lets the receive callback and queue drain in the other files
// silence their spam without duplicating the stream-state check.
bool imageWriteLogQuietFrame(const uint8_t* data, uint16_t len) {
    return len >= 2 && data[0] == 0x00 &&
           (data[1] == 0x71 || data[1] == 0x81) && imageWriteLogQuietCmd();
}
// ---------------------------------------------------------------------------

