davelee98/Firmware_Unified/targets/esp32-idf/src/display_service.cpp
    uint32_t planeBytes = calc_controller_plane_bytes(rectW, rectH);
    uint32_t expectedLogicalSize = planeBytes * 2u;

    // TODO(protocol): 0x76 (partial-write) has no RESP_* mirror in the canonical
    // header, so the opcode-echo byte in these frames — and in the send_direct_write_nack(0x76, ...)
    // calls below — stays a raw literal. Add RESP_PARTIAL_WRITE_START upstream in
    // opendisplay-protocol, then replace the raw 0x76 here.
    if (expectedLogicalSize == 0) {
        uint8_t errResponse[] = {RESP_NACK, 0x76};
        sendResponse(errResponse, sizeof(errResponse));
        return;
    }

    memset(&partialCtx, 0, sizeof(partialCtx));
    partialCtx.active = true;
    partialCtx.compressed = (flags & PARTIAL_FLAG_COMPRESSED) != 0;
    partialCtx.flags = flags;
    partialCtx.new_etag = newEtag;
    partialCtx.x = rectX;
    partialCtx.y = rectY;
    partialCtx.width = rectW;
    partialCtx.height = rectH;
    partialCtx.expected_stream_size = expectedLogicalSize;
    partialCtx.plane_size = planeBytes;
    partialCtx.current_plane = 0xFF;
    partialCtx.start_time = millis();
    imageWriteLogStart(expectedLogicalSize);

    partial_prepare_panel_ram();
    if (partialCtx.compressed) od_zlib_stream_reset(expectedLogicalSize);

    // Process optional initial stream bytes before ACK
    if (len > 17) {
        uint16_t initLen = len - 17;
        if (!partial_consume_bytes(data + 17, (uint32_t)initLen)) {
            send_direct_write_nack(0x76, OD_ERR_PARTIAL_STREAM, true);
            return;
        }
    }

    uint8_t ackResponse[] = {RESP_ACK, 0x76};
    sendResponse(ackResponse, sizeof(ackResponse));
}

void handleDirectWriteData(uint8_t* data, uint16_t len) {
    // A pipe transfer (0x0080-0x0082) owns the panel session — and a pipe-partial
    // one owns partialCtx. A stray legacy 0x71 must not feed that context out of
    // band from the sliding-window seq accounting. Silent-discard mirrors how the
    // pipe path treats frames after a fatal error.
    if (pipeState.active) return;
    if (partialCtx.active) {
        if (len == 0) return;
        if (!frameOwnsSession("0x0071 (partial)")) return;
        imageWriteLogChunk(data, len);
        if (!partial_consume_bytes(data, (uint32_t)len)) {
            send_direct_write_nack(RESP_DIRECT_WRITE_DATA_ACK, OD_ERR_PARTIAL_STREAM, true);
            return;
        }
        imageWriteLogProgress(partialCtx.bytes_received, partialCtx.expected_stream_size);
        uint8_t ackResponse[] = {RESP_ACK, RESP_DIRECT_WRITE_DATA_ACK};
        sendResponse(ackResponse, sizeof(ackResponse));
        return;
    }
    if (!directWriteActive || len == 0) return;
    if (!frameOwnsSession("0x0071")) return;
    imageWriteLogChunk(data, len);
    if (directWriteCompressed) {
        if (!handleDirectWriteCompressedData(data, len)) {
            cleanupDirectWriteState(true);
            uint8_t errorResponse[] = {RESP_NACK, RESP_DIRECT_WRITE_DATA_ACK};
            sendResponse(errorResponse, sizeof(errorResponse));
        } else {
            directWriteCompressedReceived += len;
            imageWriteLogProgress(directWriteBytesWritten, directWriteTotalBytes);
            uint8_t ackResponse[] = {RESP_ACK, RESP_DIRECT_WRITE_DATA_ACK};
            sendResponse(ackResponse, sizeof(ackResponse));
        }
        return;
    }
    uint32_t remainingBytes = (directWriteBytesWritten < directWriteTotalBytes) ? (directWriteTotalBytes - directWriteBytesWritten) : 0;
    uint16_t bytesToWrite = (len > remainingBytes) ? remainingBytes : len;
    if (bytesToWrite > 0) {
#if defined(TARGET_ESP32) && defined(OPENDISPLAY_FASTEPD)
        if (fastepd_driver_used()) {
            fastepd_direct_write_chunk(data, bytesToWrite);
            directWriteBytesWritten += bytesToWrite;
        } else
#endif
        if (directWriteIsGray4() || directWriteBitplanes) {
            streamGray4Bytes(data, bytesToWrite);  // advances directWriteBytesWritten, splits planes
        } else {
            directWriteSinkBytes(data, bytesToWrite);
        }
    }
    imageWriteLogProgress(directWriteBytesWritten, directWriteTotalBytes);
    if (directWriteBytesWritten >= directWriteTotalBytes) {
        handleDirectWriteEnd(nullptr, 0);
    } else {
        uint8_t ackResponse[] = {RESP_ACK, RESP_DIRECT_WRITE_DATA_ACK};
        sendResponse(ackResponse, sizeof(ackResponse));
    }
}

void handleDirectWriteEnd(uint8_t* data, uint16_t len) {
    // Same guard as handleDirectWriteData: a stray legacy 0x72 mid-pipe must not
    // finalize/refresh a pipe-owned session (partial would commit new_etag==0 and
    // leave pipeState zombied; full-frame would refresh with pipeState still active).
    if (pipeState.active) return;
    if ((directWriteActive || partialCtx.active) && !frameOwnsSession("0x0072")) return;
    if (partialCtx.active) {
        if (data != nullptr && len > 1) {
            send_direct_write_nack(RESP_DIRECT_WRITE_END_ACK, OD_ERR_PARTIAL_STREAM, true);
            return;
        }
        if (partialCtx.compressed) {
            if (partialCtx.bytes_received == 0 || !zlib_stream_to_partial_write(nullptr, 0, true)) {
                send_direct_write_nack(RESP_DIRECT_WRITE_END_ACK, OD_ERR_PARTIAL_STREAM, true);
                return;
            }
        } else if (partialCtx.bytes_written != partialCtx.expected_stream_size) {
            send_direct_write_nack(RESP_DIRECT_WRITE_END_ACK, OD_ERR_PARTIAL_STREAM, true);
            return;
        }
        imageWriteLogFinish(partialCtx.bytes_received, partialCtx.expected_stream_size);
        uint8_t ackResponse[] = {RESP_ACK, RESP_DIRECT_WRITE_END_ACK};
        sendResponse(ackResponse, sizeof(ackResponse));
        int refreshMode = REFRESH_PARTIAL;
        if (data != nullptr && len >= 1 && data[0] == REFRESH_FULL) refreshMode = REFRESH_FULL;
        else if (data != nullptr && len >= 1 && data[0] == REFRESH_FAST) refreshMode = REFRESH_FAST;
        bool refreshSuccess = partial_write_to_panel(refreshMode);
        if (refreshSuccess) {
            displayed_etag = partialCtx.new_etag;
            uint8_t validatedResponse[] = {RESP_ACK, RESP_DIRECT_WRITE_REFRESH_SUCCESS};
            sendResponse(validatedResponse, sizeof(validatedResponse));
        } else {
            displayed_etag = 0;
            uint8_t timeoutResponse[] = {RESP_ACK, RESP_DIRECT_WRITE_REFRESH_TIMEOUT};
            sendResponse(timeoutResponse, sizeof(timeoutResponse));
        }
        cleanup_partial_write_state();
        return;
    }
    if (!directWriteActive) return;
    directWriteFinishAndRefresh(data, len, 0x72);
}

// Shared finalize+refresh tail for a full-frame direct-write session. Emits the
// END success ack {0x00,endOpcode} (0x72 legacy / 0x82 PIPE) or a NACK
// {0xFF,endOpcode} on compressed-flush/completeness failure, then refreshes the
// panel and emits {0x00,0x73}/{0x00,0x74}. Caller guarantees directWriteActive.
static void directWriteFinishAndRefresh(uint8_t* data, uint16_t len, uint8_t endOpcode) {
    directWriteStartTime = 0;
    if (directWriteCompressed && !zlib_stream_to_direct_write(nullptr, 0, true)) {
        cleanupDirectWriteState(true);
        uint8_t errorResponse[] = {0xFF, endOpcode};
        sendResponse(errorResponse, sizeof(errorResponse));
        return;
    }
    const bool gray4 = directWriteIsGray4();
    if (gray4 || directWriteBitplanes) {
        // Both planes must be present before refresh. Compressed and uncompressed
        // paths stream live as chunks, so confirm the full two-plane payload
        // arrived before refreshing stale RAM or committing an etag.
        if (directWriteBytesWritten != directWriteTotalBytes) {
            cleanupDirectWriteState(false);
            uint8_t errorResponse[] = {0xFF, endOpcode};
            sendResponse(errorResponse, sizeof(errorResponse));
            return;
        }
    }
    imageWriteLogFinish(directWriteBytesWritten, directWriteTotalBytes);
    int refreshMode = REFRESH_FULL;
    if (data != nullptr && len >= 1 && data[0] == 1) refreshMode = REFRESH_FAST;
    if (e1004_panel_used()) refreshMode = REFRESH_FULL;  // fast re-init would wipe RAM
    const char* modeName = (refreshMode == REFRESH_FAST) ? "FAST" : "FULL";
    if (data != nullptr && len > 0) {
        od_log_info("EPD refresh: %s (mode=%d, end payload 0x%02X)", modeName, refreshMode, data[0]);
    } else {
        od_log_info("EPD refresh: %s (mode=%d, end payload none (auto))", modeName, refreshMode);
    }
    uint8_t ackResponse[] = {0x00, endOpcode};
    sendResponse(ackResponse, sizeof(ackResponse));
#ifdef TARGET_ESP32
    // Push the END ack — and the final tail ACK the auto-complete path queued just
    // before calling us — onto the air BEFORE the blocking refresh below. bbepRefresh
    // + waitforrefresh occupy the loop task for seconds on a big panel, and the loop
    // task is the response ring's only drainer, so without this the client sits in its
    // tail-flush probe loop and aborts the (already complete) transfer on PTO.
    flushResponseQueueToBle();
#endif
    delay(20);
    epdRefreshInProgress = true;
    bool refreshSuccess = false;
    uint32_t newEtag = 0;
    bool hasNewEtag = data != nullptr && len >= 5;
    if (hasNewEtag) newEtag = parse_be_u32(data + 1);
#if defined(TARGET_ESP32) && defined(OPENDISPLAY_FASTEPD)
    if (fastepd_driver_used()) {
        fastepd_direct_refresh(refreshMode);
        refreshSuccess = waitforrefresh(60);
        // No sleep here: cleanupDirectWriteState releases the session (warm or ForceOff).
    } else
#endif
    {
#ifdef BBEP_T133A01
        if (e1004_panel_used()) e1004_end_plane();
#endif
        bbepRefresh(&bbep, refreshMode);
        refreshSuccess = waitforrefresh(60);
        // No bbepSleep here: cleanupDirectWriteState(false) releases the session,
        // keeping the controller awake + rail up when keep-alive holds it warm.
    }
    epdRefreshInProgress = false;
    cleanupDirectWriteState(false);
#ifdef TARGET_ESP32
    esp32_restart_ble_advertising();
#endif
    if (refreshSuccess) {
        // A successful refresh changed the panel image. Commit the new etag
        // when the client supplied a valid one; otherwise clear the stale etag
        // (etag-less full upload / auto-complete) so a later partial update
        // gets a clean ETAG mismatch and falls back to a full upload instead
        // of diffing against the wrong, now-outdated base image.
        if (hasNewEtag && newEtag != 0) displayed_etag = newEtag;
        else displayed_etag = 0;
        uint8_t refreshResponse[] = {RESP_ACK, RESP_DIRECT_WRITE_REFRESH_SUCCESS};
        sendResponse(refreshResponse, sizeof(refreshResponse));
    } else {
        if (hasNewEtag) displayed_etag = 0;
        uint8_t timeoutResponse[] = {RESP_ACK, RESP_DIRECT_WRITE_REFRESH_TIMEOUT};
        sendResponse(timeoutResponse, sizeof(timeoutResponse));
    }
}

