davelee98/Firmware_Unified/targets/esp32-idf/src/display_service.cpp
// ===========================================================================
// PIPE_WRITE (0x0080-0x0082): sliding-window image transfer with QUIC-style SACK.
// Reuses the direct-write session machinery (directWriteComputeGeometry /
// directWriteActivatePanel / pipeConsumePayload -> bbepWriteData / zlib) so the
// legacy 0x70/0x71/0x72 path is untouched. Out-of-order frames are held in a
// 33-slot reorder queue while the controller stream pauses at a hole.
//
// PARTIAL-REGION mode (PIPE_FLAG_PARTIAL, flags bit1): a single-rectangle partial
// update rides the same sliding window. The 0x0080 START gains a 12-byte LE
// extension appended after total_size (payload len 22 instead of 10):
//   [old_etag:4 LE][x:2][y:2][w:2][h:2]   (LE, unlike 0x76's big-endian layout).
// total_size is the decompressed logical stream size = plane_size*2 where
// plane_size = calc_controller_plane_bytes(w,h) (old plane then new plane, the
// same stream 0x76 uses). Geometry/etag are validated exactly like the 0x76
// handler; the ACK sets response flags bit1 to confirm partial acceptance. DATA
// (0x0081) is routed to partialCtx (two 1bpp controller planes) instead of the
// full-frame writer, and partial transfers NEVER auto-complete — the explicit
// 0x0082 END carries the refresh selector (0->FULL,1->FAST,2/absent->PARTIAL) and
// new_etag [refresh:1][new_etag:4 BE], driving partial_write_to_panel().
// START NACK codes: 0x01 len/ver, 0x02 unknown flag, 0x03 size mismatch,
// 0x05 ETAG_MISMATCH (partial), 0x06 PARTIAL_UNSUPPORTED (partial, bpp!=1/E1004),
// 0x07 RECT_INVALID (partial, zero/OOB/misaligned rect). Any partial START NACK
// at the geometry/etag stages clears displayed_etag (parity with 0x76).
// ===========================================================================

static inline uint8_t pipeSlot(uint8_t seq) { return (uint8_t)(seq % PIPE_REORDER_SLOTS); }

void resetPipeWriteState(void) {
    pipeState = PipeWriteState{};
    for (int i = 0; i < PIPE_REORDER_SLOTS; ++i) pipeReorder[i].occupied = false;
}

bool pipeWriteActive(void) { return pipeState.active; }

// True while ANY of the three transfer types is streaming. The three flags live in
// three different places (directWriteActive is a global; pipeState/partialCtx are
// file-static here), so every caller that just means "a transfer is in flight" used
// to spell the disjunction out itself -- and drifted: the WiFi roam gate checked
// direct+pipe but not partial, so a BLE-origin partial write with no LAN client
// attached could be interrupted by a full-channel scan. Add a fourth transfer type
// here, not in each caller.
//
// Callers wanting ONE specific transfer keep testing that flag directly (the
// direct-write watchdog and its teardown, the 0x0072 session-ownership check).
bool transferActive(void) {
    return directWriteActive || pipeState.active || partialCtx.active;
}

// A chunk c is "received" for ACK purposes if it was accepted in-order (lies just
// below expected_seq within the mask window) or is currently held in the reorder
// queue. The accepted-prefix depth is bounded by received_count (chunks actually
// streamed this transfer, i.e. expected_seq advances): a plain mod-256 distance
// test would wrap during the first 32 chunks and assert phantom "received" bits
// for seqs 224-255 that predate the transfer (e.g. expected_seq=8 claiming seq
// 250). Never marks an in-range unreceived chunk; highest_seen=0 with only chunk
// 0 accepted yields mask=0.
static bool pipeChunkReceived(uint8_t c) {
    uint8_t below = (uint8_t)(pipeState.expected_seq - 1 - c);   // distance below expected
    uint32_t acceptedDepth = (pipeState.received_count < PIPE_ACK_MASK_BITS)
                           ? pipeState.received_count : PIPE_ACK_MASK_BITS;
    if (below < acceptedDepth) return true;                      // accepted (in-order prefix)
    return pipeReorder[pipeSlot(c)].occupied && pipeReorder[pipeSlot(c)].seq == c;
}

// Fills out[0]=highest_seen, out[1..4]=32-bit ack_mask LE. Mask bit i (LSB first)
// = chunk (highest_seen - 1 - i) received. highest_seen implicitly acked.
static void pipeBuildAckPayload(uint8_t* out) {
    uint8_t hs = pipeState.has_received ? pipeState.highest_seen
                                        : (uint8_t)(pipeState.expected_seq - 1);
    uint32_t mask = 0;
    for (uint8_t i = 0; i < PIPE_ACK_MASK_BITS; ++i) {
        if (pipeChunkReceived((uint8_t)(hs - 1 - i))) mask |= (1u << i);
    }
    out[0] = hs;
    out[1] = (uint8_t)(mask & 0xFF);
    out[2] = (uint8_t)((mask >> 8) & 0xFF);
    out[3] = (uint8_t)((mask >> 16) & 0xFF);
    out[4] = (uint8_t)((mask >> 24) & 0xFF);
}

// TODO(protocol): the canonical opendisplay_protocol.h defines no RESP_* mirror
// for the pipe-write opcodes, so the response opcode-echo byte in the helpers
// below (0x80 / 0x81 / 0x82) stays a raw literal. It also defines no data-phase
// pipe error namespace (only OD_ERR_PIPE_START_* for the 0x80 START), so the
// sendPipeNack() error codes (0x03 over-size/overflow, 0x04 out-of-window) are
// raw too. Add RESP_PIPE_WRITE_{START,DATA,END} + an OD_ERR_PIPE_DATA_* set
// upstream in opendisplay-protocol, then replace those literals here.

// {0x00,0x81, highest_seen, ack_mask LE(4)} via sendResponse (auto-encrypts when
// authenticated). Resets both cadence counters.
static void sendPipeAck(void) {
    uint8_t r[7] = {RESP_ACK, 0x81, 0, 0, 0, 0, 0};
    pipeBuildAckPayload(r + 2);
    sendResponse(r, sizeof(r));
    pipeState.frames_since_ack = 0;
    pipeState.ooo_acks_since_gap = 0;
}

// {0xFF,0x81, err, highest_seen, ack_mask LE(4)}. All 0x81 NACKs are FATAL: the
// payload is built from pipeState + reorder queue BEFORE any teardown, the error
// flag makes subsequent 0x0081 frames silently discard until the next 0x0080 /
// disconnect (pipeState and the reorder queue are deliberately NOT reset so the
// reported ACK position stays consistent), and the panel hardware is released the
// same way the legacy mid-stream {0xFF,0x71} failure does (cleanupDirectWriteState
// with refreshDisplay=true: sleep a powered controller cleanly, cut power, resume
// touch) instead of leaving the panel powered until the next transfer.
static void sendPipeNack(uint8_t err) {
    uint8_t r[8] = {RESP_NACK, 0x81, err, 0, 0, 0, 0, 0};
    pipeBuildAckPayload(r + 3);
    sendResponse(r, sizeof(r));
    pipeState.error = true;
    // Partial transfers own partialCtx, not the full-frame direct-write session:
    // clear the negotiated etag (any partial NACK invalidates it, parity with
    // send_direct_write_nack) and power the panel down via the partial cleanup.
    if (pipeState.partial) {
        displayed_etag = 0;
        cleanup_partial_write_state();
    } else {
        cleanupDirectWriteState(true);
    }
}

