davelee98/Firmware_Unified/targets/esp32-idf/src/display_service.cpp
// {0xFF,0x80, err, 0x00}. Caller owns any session teardown.
static void sendPipeStartNack(uint8_t err) {
    uint8_t r[4] = {RESP_NACK, 0x80, err, 0x00};
    sendResponse(r, sizeof(r));
}

// Advance highest_seen only for a genuinely newer seq (forward distance small and
// nonzero) so duplicates/late frames never move it backward.
static void pipeUpdateHighestSeen(uint8_t seq) {
    if (!pipeState.has_received) {
        pipeState.has_received = true;
        pipeState.highest_seen = seq;
        return;
    }
    uint8_t fwd = (uint8_t)(seq - pipeState.highest_seen);
    if (fwd != 0 && fwd <= PIPE_ACK_MASK_BITS) pipeState.highest_seen = seq;
}

// Feed one DATA payload to the panel controller through the SAME machinery the
// legacy 0x71 path uses. Returns false on any write/decompress/overflow failure.
static bool pipeConsumePayload(uint8_t* data, uint16_t len) {
    if (len == 0) return true;
    imageWriteLogChunk(data, len);
    // Partial transfers stream into the two 1bpp controller planes via partialCtx;
    // partial_consume_bytes handles zlib-vs-raw and plane-at-a-time sub-window
    // addressing itself, so the full-frame directWrite* writers below are skipped.
    if (pipeState.partial) {
        if (!partial_consume_bytes(data, (uint32_t)len)) return false;
        imageWriteLogProgress(partialCtx.bytes_received, partialCtx.expected_stream_size);
        return true;
    }
    if (directWriteCompressed) {
        if (!handleDirectWriteCompressedData(data, len)) return false;
        directWriteCompressedReceived += len;
        imageWriteLogProgress(directWriteBytesWritten, directWriteTotalBytes);
        return true;
    }
    uint32_t remaining = (directWriteBytesWritten < directWriteTotalBytes)
                       ? (directWriteTotalBytes - directWriteBytesWritten) : 0;
    uint16_t toWrite = (len > remaining) ? (uint16_t)remaining : len;
    if (toWrite > 0) {
#if defined(TARGET_ESP32) && defined(OPENDISPLAY_FASTEPD)
        if (fastepd_driver_used()) {
            fastepd_direct_write_chunk(data, toWrite);
            directWriteBytesWritten += toWrite;
        } else
#endif
        if (directWriteIsGray4() || directWriteBitplanes) {
            streamGray4Bytes(data, toWrite);  // advances directWriteBytesWritten, splits planes
        } else {
            directWriteSinkBytes(data, toWrite);
        }
    }
    imageWriteLogProgress(directWriteBytesWritten, directWriteTotalBytes);
    return true;
}

void handlePipeWriteStart(uint8_t* data, uint16_t len) {
    sessionOrigin = commandOrigin();
    // A new START aborts any in-flight transfer of any family and resets pipe state
    // (mirrors legacy START). Reset happens up-front so even a malformed START is safe.
    if (partialCtx.active) cleanup_partial_write_state();
    if (directWriteActive) cleanupDirectWriteState(false);
    resetPipeWriteState();

    // Fixed 10-byte payload (opcode already stripped by the dispatcher):
    // ver(1)+flags(1)+req_w(1)+req_n(1)+client_max_frame(2)+total_size(4).
    // Tolerate trailing bytes (future fields).
    if (len < sizeof(struct PipeStartRequest)) { sendPipeStartNack(OD_ERR_PIPE_START_BAD_HEADER); return; }
    struct PipeStartRequest req;
    memcpy(&req, data, sizeof req);   // canonical 10-byte LE header (byte-identical to the old shifts)
    uint8_t  ver              = req.version;
    uint8_t  flags            = req.flags;
    uint8_t  req_w            = req.req_window;
    uint8_t  req_n            = req.req_ack_every;
    uint16_t client_max_frame = req.client_max_frame;
    uint32_t total_size       = req.total_size;

    if (ver != PIPE_VERSION) { sendPipeStartNack(OD_ERR_PIPE_START_BAD_HEADER); return; }
    // Defined flags: bit0 zlib compression, bit1 partial-region refresh. Any other bit unsupported.
    if ((flags & ~(PIPE_FLAG_COMPRESSED | PIPE_FLAG_PARTIAL)) != 0) { sendPipeStartNack(OD_ERR_PIPE_START_UNKNOWN_FLAG); return; }

    bool compressed = (flags & PIPE_FLAG_COMPRESSED) != 0;
    bool partial    = (flags & PIPE_FLAG_PARTIAL) != 0;

    // Partial START appends a 12-byte LE extension after total_size (payload len 22 vs 10):
    // [old_etag:4][x:2][y:2][w:2][h:2]. LE, unlike 0x76's big-endian layout.
    if (partial && len < sizeof(struct PipeStartRequest) + sizeof(struct PipePartialExt)) {
        sendPipeStartNack(OD_ERR_PIPE_START_BAD_HEADER); return;
    }
    uint32_t old_etag = 0;
    uint16_t rectX = 0, rectY = 0, rectW = 0, rectH = 0;
    uint32_t planeBytes = 0;
    if (partial) {
        struct PipePartialExt ext;
        memcpy(&ext, data + sizeof(struct PipeStartRequest), sizeof ext);  // 12-byte LE extension
        old_etag = ext.old_etag;
        rectX = ext.x;
        rectY = ext.y;
        rectW = ext.w;
        rectH = ext.h;

        // Partial validations (plan 1.2, order 5-7). All precede any hardware touch; any
        // failure clears displayed_etag for parity with send_direct_write_nack. These are
        // the same checks the 0x76 handler runs (bpp, etag, bounds, alignment).
        uint16_t dispW = globalConfig.displays[0].pixel_width;
        uint16_t dispH = globalConfig.displays[0].pixel_height;
        // 5: partial uses two 1bpp planes (old+new). FastEPD IT8951 accepts that stream
        // and applies a row-band update; 2bpp+/E1004 remain unsupported.
        if (getBitsPerPixel() != 1 || e1004_panel_used()) {
            displayed_etag = 0; sendPipeStartNack(OD_ERR_PIPE_START_PARTIAL_UNSUPPORTED); return;
        }
        // 6: etag gate — nonzero and must match what is currently on the panel.
        if (old_etag == 0 || old_etag != displayed_etag) {
            displayed_etag = 0; sendPipeStartNack(OD_ERR_PIPE_START_ETAG_MISMATCH); return;
        }
        // 7: rectangle must be non-empty, in-bounds, and x/width byte-aligned (1bpp packing).
        if (rectW == 0 || rectH == 0 ||
            (uint32_t)rectX + rectW > dispW || (uint32_t)rectY + rectH > dispH ||
            (rectX & 7u) != 0 || (rectW & 7u) != 0) {
            displayed_etag = 0; sendPipeStartNack(OD_ERR_PIPE_START_RECT_INVALID); return;
        }
    }

    // total_size validation (plan 1.2, order 8). Pure config/geometry math (no panel I/O),
    // so a NACK here needs no teardown. Partial: plane_size*2 (flat old+new planes, like
    // 0x76). Full: directWriteComputeGeometry's decompressed panel byte total.
    if (partial) {
        planeBytes = calc_controller_plane_bytes(rectW, rectH);
        if (planeBytes == 0 || total_size != planeBytes * 2u) {
            // Plan 1.2: every partial-request NACK at steps 5-8 clears the etag
            // (parity with send_direct_write_nack).
            displayed_etag = 0; sendPipeStartNack(OD_ERR_PIPE_START_SIZE_MISMATCH); return;
        }
    } else {
        directWriteComputeGeometry(compressed);
        if (total_size != directWriteTotalBytes) { sendPipeStartNack(OD_ERR_PIPE_START_SIZE_MISMATCH); return; }
    }

    // Effective values (min-rule, plan 1.1). Floors at 1; N <= W; frame <= 244.
    uint8_t w_eff = req_w > PIPE_MAX_W ? PIPE_MAX_W : req_w;
    if (w_eff == 0) w_eff = 1;
    if (isEncryptionEnabled() && isAuthenticated() && w_eff > 32) w_eff = 32;  // defensive (mask width)
    uint8_t n_eff = req_n > PIPE_MAX_N ? PIPE_MAX_N : req_n;
    if (n_eff == 0) n_eff = 1;
    if (n_eff > w_eff) n_eff = w_eff;
    uint16_t frame_eff = client_max_frame < PIPE_MAX_FRAME ? client_max_frame : PIPE_MAX_FRAME;

    pipeState.active = true;
    pipeState.error = false;
    pipeState.compressed = compressed;
    pipeState.gap_open = false;
    pipeState.window = w_eff;
    pipeState.ack_every = n_eff;
    pipeState.max_frame = frame_eff;
    pipeState.expected_seq = 0;
    pipeState.has_received = false;
    pipeState.highest_seen = 0;
    pipeState.received_count = 0;
    pipeState.frames_since_ack = 0;
    pipeState.ooo_acks_since_gap = 0;
    pipeState.total_size = total_size;
    pipeState.queued_count = 0;
    pipeState.queue_high_water = 0;
    pipeState.partial = partial;

    // Partial transfers own partialCtx (two 1bpp planes); init it exactly as the 0x76
    // START does, but new_etag stays 0 — it rides the 0x0082 END. Bookkeeping only; the
    // panel RAM prep (partial_prepare_panel_ram) waits until after the ACK, below.
    if (partial) {
        memset(&partialCtx, 0, sizeof(partialCtx));
        partialCtx.active = true;
        partialCtx.compressed = compressed;
        partialCtx.flags = flags;
        partialCtx.new_etag = 0;
        partialCtx.x = rectX;
        partialCtx.y = rectY;
        partialCtx.width = rectW;
        partialCtx.height = rectH;
        partialCtx.expected_stream_size = total_size;
        partialCtx.plane_size = planeBytes;
        partialCtx.current_plane = 0xFF;
        partialCtx.start_time = millis();
    }

